//////  กล่องที่ 3  ////////////


void box_3()
{
  ////////////// เริ่มเดินจากแยกสุดท้ายก่อนถึงกล่อง///////////////
       
        BZ(30);servo_kangmark(); Motor(0,0,100);S_down() ; 
      
        fline (5 ,5, 5, 10, 'f',5 ); BZ(30);servo_small(); BZ(30);BZ(30);BZ(30); 


  /// แนะนำให้เขียนจาก แยกสุดท้ายที่เข้าไปเก็บกล่อง
  
  /////////////จบที่ คีบกล่อง ที่2  ///////////////

  //////////////////////////////////////*********************///////////////////////////////////เช็คสีกล่อง
        
         
         
         box_val();      //////////////////////////เช็คสีกล่อง   เก็บค่าสีกล่องไว้ในตัวแปร color_box_val
  
       

  //////////////////////////////////////////////////////////////////////////////ตัดสินใจในการนำกล่องไปวาง
       
       
   if(color_box_val==color_a)
        {
              /////////////////เดินไปที่พื้นสีที่ 1 เพื่อวางกล่อง แล้วเดินไปจุดสิ้นสุด 

              
              bline (20 ,20,5, 10, 'c','l', 10); BZ(30);
              do{ read_sensor_F(); Motor(-20,20); } while(A7>200);
              do{  Motor(0,20); } while(digitalRead(PA11)==1);delay(80); Motor(-10,-30,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
              do{ read_sensor_F(); Motor(0,-20); } while(A3>80);  Motor(10,30,4); Motor(0,0,5); BZ(30);  S_down();servo_small();  
              colorline (20 ,20, 10, 'l','l', 10);  BZ(30);
              colorline (20 ,20, 10, 'l','c', 2);  BZ(30);
              fline (20 ,20,5, 10, 'g',1 ); BZ(30);
              fline (20 ,20,3, 10, 'f','r',5 ); BZ(30);    
              fline (20 ,20,5, 10, 'c','l',5 ); BZ(30);           


              
                                    
        }

        
    else if(color_box_val==color_b)
        {
                            
                    /////////////////เดินไปที่พื้นสีที่ 2 เพื่อวางกล่อง แล้วเดินไปจุดสิ้นสุด 
               fline (20 ,20,5, 10, 'c','l',10); BZ(30); 
               fline (15 ,15,5, 10, 'c',10); BZ(30); 

               do{ read_sensor_F(); Motor(20,0); } while(A0>200);
               do{  Motor(20,0); } while(digitalRead(PA10)==1);delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
               do{ read_sensor_F(); Motor(-20,0); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);S_down();servo_small();
                            
               colorline (20 ,20, 5, 'r','l', 10);  BZ(30); 
               fline (15 ,15,5, 10, 'g',2); BZ(30);
               fline (20 ,20,2, 10, 'c','r',10); BZ(30);  
               fline (20 ,20,5, 10, 'f','l',10); BZ(30); 
               fline (20 ,20,5, 10, 'g',2); BZ(30);
               fline (20 ,20,2, 10, 'c','l',10); BZ(30);  
               fline (20 ,20,5, 10, 'c','r',5); BZ(30);        


                    
                    
         }
    
     else
          {
                  
                    /////////////////เดินไปที่พื้นสีที่ สุดท้าย เพื่อวางกล่อง แล้วเดินไปจุดสิ้นสุด

                 fline (20 ,20,5, 10, 'g',10); BZ(30); 
                 fline (20 ,20,5, 10, 'f','l',10); BZ(30); 
                 fline (20 ,20,10, 10, 'g',2); BZ(30);
                 colorline (20 ,20, 5, 'l','c', 2);  BZ(30);
                 fline (15 ,15,5, 10, 'c',5); BZ(30);
                 do{ read_sensor_F(); Motor(20,0); } while(A0>200);
                 do{  Motor(20,0); } while(digitalRead(PA10)==1);delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
                 do{ read_sensor_F(); Motor(-20,0); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);S_down();servo_small();
                            
                 colorline (20 ,20, 5, 'r','l', 10);  BZ(30); 
                 fline (40 ,40,5, 100, 'f','l',10); BZ(30); 
                 fline (20 ,20,5, 10, 'f','r',10); BZ(30); 
                  fline (20 ,20,5, 10, 'g',2); BZ(30);
               fline (20 ,20,2, 10, 'c','l',10); BZ(30);  
               fline (20 ,20,5, 10, 'c','r',5); BZ(30);       


                                  
           }
        
}



  
  


 
