

void box_1()
     {
         color_a=0.0;
         color_b=0.0;
         color_c=0.0;
         color_d=0.0;
         color_c=0.0;
         color_e=0.0;
  
//////////////////////////////////////////////////////  เดินจากจุดสตาร์ท ไปเก็บกล่องสี แล้วเดินจนถึงพื้นสีที่ 1

   /*fline (20 ,20,5,10, 'g',2 ); BZ(30);servo_kang() ;S_down() ;
   fline (15 ,15,5,30,2 );
   fline (6  ,6 , 5, 10, 'f',15 ); BZ(30);servo_small();
   fline (20 ,20,5, 10, 'f','l',5 ); BZ(30);
   fline (20 ,20,5, 10, 'f','l',5 ); BZ(30);
   fline (20 ,20,5, 10, 'f','r',15 ); BZ(30);
   fline (8 ,8,12, 10, 'c',15 ); BZ(30);*/
  fline (60 ,60,5, 10, 'c','r',15 ); 
  fline (60 ,60,5, 10, 'c','l',15 ); 
  fline (60 ,60,5, 10, 'c','l',15 ); 
  fline (60 ,60,5, 10, 'c','r',15 );
  //gotokeep
  servo_kang(); 
  S_down();
  fline (20 ,20,5, 10, 'c',15 ); 
  keep();
  delay(300);
  right();

  fline (60 ,60,5, 10, 'c','l',15 ); 
  fline (40 ,40,5, 10, 'c',15 ); 
  fline (20 ,20,5, 10, 'c',15 ); 
    
///////////////////////////////////////////////////////////เก็บค่าสีพื้น ที่ 1 ถ้ากรอบอยู่ข้างซ้าย ให้เลือก spi_color_l_a ();  ถ้ากรอบอยู่ข้างซ้าย ให้เลือก spi_color_r_a (); 

                       /////////เก็บค่าในรูปตัวแปล color_a  ซึ่งจะเป็นอะไรก็ได้ ตั้งแต่ 1234567
       spi_color_l_a ();
     //    spi_color_r_a (); 
                      
  //       sw();



////////////////////////////////////////////////////////////////เช็คสีกล่อง กับสีพื้น
       
       ch_color_box();
  
       //ch_color_floor_spi_r();
       ch_color_floor_spi_l();
  
       if  (color_spi_l == color_box)
            {
            //ปล่อย
            
             //do{ read_sensor_F(); Motor(-20,20); } while(A0>200); Motor(0,0,2); 
             //do{ Motor(20,-20); } while(digitalRead(PA10)==1); delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             Motor(-20,20);  delay(250); Motor(0,0,2); 
             BZ(30); servo_kang(); delay(100); S_UP(); 
             Motor(20,-20);  delay(250); Motor(0,0,2); 
             //do{ read_sensor_F(); Motor(20,-20); } while(A4>200); Motor(0,0,2); 
             //do{ read_sensor_F(); Motor(-20,15); } while(A4>80);   BZ(30);    
                  
          

            }
            
       else 
            {
               
               
            }
      
//////////////////////////////////////////////////////////// เดินไปสีพื้นที่ 2

   /*
  colorline (20 ,20, 5, 'r','l', 10);  BZ(30);
  fline (20 ,20,5, 10, 'f','r',10 ); BZ(30);
  fline (8 ,8,5, 10, 'c',15 ); BZ(30);
*/
  
colorline (20 ,20, 10, 'l','l', 10); 
 colorline (20 ,20, 10, 'l','c', 10); 
  TR();
  fline (60 ,60,1, 10, 'c','l',15 );
   fline (60 ,60,5, 10, 'c',15 ); 

 //  sw();


 ///////////////////////////////////////////////////////////เก็บค่าสีพื้น ที่ 2 ถ้ากรอบอยู่ข้างซ้าย ให้เลือก spi_color_l_a ();  ถ้ากรอบอยู่ข้างขวา ให้เลือก spi_color_r_a (); 

        spi_color_r_b ();    BZ(30);BZ(30);              /////////เก็บค่าในรูปตัวแปล color_b  ซึ่งจะเป็นอะไรก็ได้ ตั้งแต่ 1234567
  ///   spi_color_l_b ();    BZ(30);BZ(30); 

        

////////////////////////////////////////////////////////////////เช็คสีกล่อง กับสีพื้น พื้นสีที่ 2
       ch_color_box();  
       ch_color_floor_spi_r();
       
  
       if  (color_spi_r == color_box)       /////////////////////////วางกล่องแล้วเดินไปถึงแยกก่อนเข้าคีบกล่องที่ 2
            {

             //do{ read_sensor_F(); Motor(20,0); } while(A0>200);
             //do{  Motor(20,-20); } while(digitalRead(PA10)==1); delay(80);Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             Motor(20,-20);  delay(250); Motor(0,0,2); 
             BZ(30); servo_kang(); delay(100); S_UP(); 
             Motor(-20,20);  delay(250); Motor(0,0,2); 
             //do{ read_sensor_F(); Motor(-20,15); } while(A4>80);   BZ(30);    
             //bline (20 ,20,5, 10, 'c','l',8 ); BZ(30); *                  
                                      
             fline (60 ,60,5, 10, 'c',15 );        
          fline (60 ,60,5, 10, 'c','l',15 ); 
          fline (60 ,60,5, 10, 'c','l',15 ); 
servo_kang() ;S_down() ; 
            }
            
       else if (color_box == 7)    /////////////////////////////////เดินไปกล่อง 2 เดินไปข้ามแยกก่อนเข้าคีบกล่องที่ 2  
            {            
                                               
colorline (20 ,20, 10, 'r','c', 10);      
          fline (60 ,60,5, 10, 'c','l',15 ); 
          fline (60 ,60,5, 10, 'c','l',15 ); 
servo_kang() ;S_down() ; 
                              
              
                    
                       
            }
                   
        else            ///////////////////////////////////////////////ถ้ามีกล่อง  ให้เดินไปพื้นที่ 3  วางกล่องที่พื้นที่ 3  แล้วเดินที่ที่กล่องที่ 2 ก่อนถึงกล่องที่ 2 ให้เข้าทางเดียวกันกับ ตอนเช็คพื้นที่ 2
                                                                  
            {
                /*colorline (20 ,20, 5, 'r','l', 10);  BZ(30);
                fline (15 ,15,10, 10, 'c',10 ); BZ(30);       
                do{ read_sensor_F(); Motor(20,0); } while(A0>200);
                do{  Motor(20,0); } while(digitalRead(PA10)==1); delay(80);Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
                do{ read_sensor_F(); Motor(-20,0); } while(A4>80);   BZ(30);                       
                bline (20 ,20,10, 10, 'c','l',10 ); BZ(30);
                colorline (20 ,20, 5, 'l','c', 2);  BZ(30); 
                fline (20 ,20,10, 10, 'f','r',10 ); BZ(30);     */
                colorline (20 ,20, 10, 'r','c', 10);   
          fline (60 ,60,5, 10, 'c','l',15 ); 
           fline (60 ,60,5, 10, 'c',15 );  
            fline (60 ,60,5, 10, 'c',15 );  
            Motor(-20,20);  delay(250); Motor(0,0,2); 
             BZ(30); servo_kang(); delay(100); S_UP(); 
             Motor(20,-20);  delay(250); Motor(0,0,2); 
             right(); right();                                      
              fline (60 ,60,5, 10, 'c','r',15 );   
                 servo_kang() ;S_down() ;   
                                  
            }   

                       
 
}
//////***********************  กล่องที่ 2  **************************////////////



void box_2()
{
  ////////////// เริ่มเดินจากแยกสุดท้ายก่อนถึงกล่อง ////////////////// แนะนำให้เขียนจาก แยกสุดท้ายที่เข้าไปเก็บกล่อง
       
       BZ(30);servo_kangmark(); Motor(0,0,100);S_down() ; 
      
        fline (8 ,8, 5, 10, 'f',5 ); BZ(30);servo_small(); BZ(30);BZ(30);BZ(30); 


  
  
  /////////////จบที่ คีบกล่อง ที่2  ///////////////

    
     box_val();      ////////////////เก็บค่าสีกล่องไว้ในตัวแปร color_box_val
      
  /////////////////////////////////////////////////////// 

  //////////////////////////////////////////////////////////////////////////////ตัดสินใจในการนำกล่องไปวาง
   //  sw();  
       
   if(color_box_val==color_a)
        {
              /////////////////เดินไปที่พื้นสีที่ 1 เพื่อวางกล่อง แล้วเดินไปกล่องที่ 3 (ข้ามแยกก่อนถึงกล่อง)

              UT_R();
              fline (40 ,40,5, 65, 'c',15 ); BZ(30);
              do{ read_sensor_F(); Motor(20,0); } while(A0>200);
              do{  Motor(20,-20); } while(digitalRead(PA10)==1); delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
              do{ read_sensor_F(); Motor(-20,15); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);    
              colorline (20 ,20, 5, 'r','l', 10);  BZ(30);              


              
                                    
        }

        
    else if(color_box_val==color_b)
        {
                            
                    /////////////////เดินไปที่พื้นสีที่ 1 เพื่อวางกล่อง แล้วเดินไปกล่องที่ 3 (ข้ามแยกก่อนถึงกล่อง  แนะนำให้เข้าทางเดียวกัน  ก่อนเข้าไปคีบกล่อง 3) 

              
              bline (30 ,30,5, 25, 'c','r',8 ); BZ(30);
              fline (8 ,8,5, 10, 'c',15 ); BZ(30);
              do{ read_sensor_F(); Motor(20,-20); } while(A0>200);
              do{  Motor(20,0); } while(digitalRead(PA10)==1);delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
              do{ read_sensor_F(); Motor(-20,0); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);
              bline (20 ,20,5, 10, 'c','r',8 ); BZ(30);
              fline (20 ,20,5, 10, 'g',1 ); BZ(30);
              colorline (20 ,20, 5, 'r','l', 10);  BZ(30);        

                    
                    
         }
     else 
         {                            
                    /////////////////เดินไปที่พื้นสีที่ สุดท้าย เพื่อวางกล่อง แล้วเดินไปกล่องที่ 3 (ข้ามแยกก่อนถึงกล่อง  แนะนำให้เข้าทางเดียวกัน  ก่อนเข้าไปคีบกล่อง 3) 

              
              fline (10 ,10,5, 10, 'f','r',8 ); BZ(30);
              fline (30 ,30,5, 30, 'c',8 ); BZ(30);
              do{ read_sensor_F(); Motor(20,0); } while(A0>200);
              do{  Motor(20,0); } while(digitalRead(PA10)==1);delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
              do{ read_sensor_F(); Motor(-20,0); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);
              bline (30 ,30,5, 35, 'c','r',8 ); BZ(30);
              fline (40 ,40,5, 100, 'c',2 ); BZ(30);
              colorline (20 ,20, 5, 'r','l', 10);  BZ(30);        

                    
                    
          }
    
        
}

//////  กล่องที่ 3  ////////////


void box_3()
{
  ////////////// เริ่มเดินจากแยกสุดท้ายก่อนถึงกล่อง///////////////
       
        BZ(30);servo_kangmark(); Motor(0,0,100);S_down() ; 
      
        fline (5 ,5, 5, 10, 'f',5 ); BZ(30);servo_small(); BZ(30);BZ(30);BZ(30); 


  /// แนะนำให้เขียนจาก แยกสุดท้ายที่เข้าไปเก็บกล่อง
  
  /////////////จบที่ คีบกล่อง ที่2  ///////////////

  //////////////////////////////////////*********************///////////////////////////////////เช็คสีกล่อง
        
         
         
         box_val();      //////////////////////////เช็คสีกล่อง   เก็บค่าสีกล่องไว้ในตัวแปร color_box_val
  
       

  //////////////////////////////////////////////////////////////////////////////ตัดสินใจในการนำกล่องไปวาง
       
       
   if(color_box_val==color_a)
        {
              /////////////////เดินไปที่พื้นสีที่ 1 เพื่อวางกล่อง แล้วเดินไปจุดสิ้นสุด 

              
              bline (20 ,20,5, 10, 'c','l', 10); BZ(30);
              do{ read_sensor_F(); Motor(-20,20); } while(A7>200);
              do{  Motor(0,20); } while(digitalRead(PA11)==1);delay(80); Motor(-10,-30,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
              do{ read_sensor_F(); Motor(0,-20); } while(A3>80);  Motor(10,30,4); Motor(0,0,5); BZ(30);  S_down();servo_small();  
              colorline (20 ,20, 10, 'l','l', 10);  BZ(30);
              colorline (20 ,20, 10, 'l','c', 2);  BZ(30);
              fline (20 ,20,5, 10, 'g',1 ); BZ(30);
              fline (20 ,20,3, 10, 'f','r',5 ); BZ(30);    
              fline (20 ,20,5, 10, 'c','l',5 ); BZ(30);           


              
                                    
        }

        
    else if(color_box_val==color_b)
        {
                            
                    /////////////////เดินไปที่พื้นสีที่ 2 เพื่อวางกล่อง แล้วเดินไปจุดสิ้นสุด 
               fline (20 ,20,5, 10, 'c','l',10); BZ(30); 
               fline (15 ,15,5, 10, 'c',10); BZ(30); 

               do{ read_sensor_F(); Motor(20,0); } while(A0>200);
               do{  Motor(20,0); } while(digitalRead(PA10)==1);delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
               do{ read_sensor_F(); Motor(-20,0); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);S_down();servo_small();
                            
               colorline (20 ,20, 5, 'r','l', 10);  BZ(30); 
               fline (15 ,15,5, 10, 'g',2); BZ(30);
               fline (20 ,20,2, 10, 'c','r',10); BZ(30);  
               fline (20 ,20,5, 10, 'f','l',10); BZ(30); 
               fline (20 ,20,5, 10, 'g',2); BZ(30);
               fline (20 ,20,2, 10, 'c','l',10); BZ(30);  
               fline (20 ,20,5, 10, 'c','r',5); BZ(30);        


                    
                    
         }
    
     else
          {
                  
                    /////////////////เดินไปที่พื้นสีที่ สุดท้าย เพื่อวางกล่อง แล้วเดินไปจุดสิ้นสุด

                 fline (20 ,20,5, 10, 'g',10); BZ(30); 
                 fline (20 ,20,5, 10, 'f','l',10); BZ(30); 
                 fline (20 ,20,10, 10, 'g',2); BZ(30);
                 colorline (20 ,20, 5, 'l','c', 2);  BZ(30);
                 fline (15 ,15,5, 10, 'c',5); BZ(30);
                 do{ read_sensor_F(); Motor(20,0); } while(A0>200);
                 do{  Motor(20,0); } while(digitalRead(PA10)==1);delay(80); Motor(-30,-10,4); Motor(0,0,5); BZ(30); servo_kang(); delay(100); S_UP();
             
                 do{ read_sensor_F(); Motor(-20,0); } while(A4>80);  Motor(30,10,4); Motor(0,0,5); BZ(30);S_down();servo_small();
                            
                 colorline (20 ,20, 5, 'r','l', 10);  BZ(30); 
                 fline (40 ,40,5, 100, 'f','l',10); BZ(30); 
                 fline (20 ,20,5, 10, 'f','r',10); BZ(30); 
                  fline (20 ,20,5, 10, 'g',2); BZ(30);
               fline (20 ,20,2, 10, 'c','l',10); BZ(30);  
               fline (20 ,20,5, 10, 'c','r',5); BZ(30);       


                                  
           }
        
}



  
  


 
 
